outputs/ELL-2-4-30-30-10-5/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet
    {
        type            pressureInletVelocity;
        value           uniform (0 0 0); 
    }

	outlet
	{
		type            inletOutlet;
        inletValue      uniform (0 0 0);        // Used if backflow occurs
        value           uniform (0 0 0);        // Required syntax; 
	}
	
	frontAndBack
    {
        type            empty;
    }

	symmetry
	{
		type			symmetryPlane;
	}

    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
